# ExportLineweightTableIterator Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLineweightTableIterator Class
Members See Also
---
An iterator to a set of line weight table.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class ExportLineweightTableIterator : IEnumerator<KeyValuePair<ExportLineweightKey, ExportLineweightInfo>>
```

Visual Basic
---
```text
Public Class ExportLineweightTableIterator _
	Implements IEnumerator(Of KeyValuePair(Of ExportLineweightKey, ExportLineweightInfo))
```

Visual C++
---
```text
public ref class ExportLineweightTableIterator : IEnumerator<KeyValuePair<ExportLineweightKey^, ExportLineweightInfo^>>
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ExportLineweightTableIterator
# See Also
ExportLineweightTableIterator Members
Autodesk.Revit.DB Namespace